tutorials/XiFluid/engine2Valve2D/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

height 5;

evMeshLeft $blockMeshDict.cylinder!x1a;
evMeshSpan #calc "$blockMeshDict.cylinder!x0b - $evMeshLeft";

ivMeshLeft $blockMeshDict.cylinder!x1b;
ivMeshSpan #calc "$blockMeshDict.cylinder!x0c - $evMeshLeft";

baffles
{
    baffles_ev_port
    {
        type        surface;
        surface     plate;
        origin      ($evMeshLeft $height -1e3);
        span        ($evMeshSpan 0        2e3);

        owner
        {
            name            nonCouple_ep_ev;
            type            patch;
        }
        neighbour
        {
            name            nonCouple_ev_ep;
            type            patch;
        }
    }

    baffles_iv_port
    {
        type        surface;
        surface     plate;
        origin      ($ivMeshLeft $height -1e3);
        span        ($ivMeshSpan 0        2e3);

        owner
        {
            name            nonCouple_ip_iv;
            type            patch;
        }
        neighbour
        {
            name            nonCouple_iv_ip;
            type            patch;
        }
    }
}

// ************************************************************************* //
